MikroElektronika/core_packages/PIC/XC8/def/PIC18F1220/mcu.h
extern volatile PORTBbits_t PORTBbits __at(0xF81);
// bitfield macros
#define _PORTB_RB0_POSN                                     0x0
#define _PORTB_RB0_POSITION                                 0x0
#define _PORTB_RB0_SIZE                                     0x1
#define _PORTB_RB0_LENGTH                                   0x1
#define _PORTB_RB0_MASK                                     0x1
#define _PORTB_RB1_POSN                                     0x1
#define _PORTB_RB1_POSITION                                 0x1
#define _PORTB_RB1_SIZE                                     0x1
#define _PORTB_RB1_LENGTH                                   0x1
#define _PORTB_RB1_MASK                                     0x2
#define _PORTB_RB2_POSN                                     0x2
#define _PORTB_RB2_POSITION                                 0x2
#define _PORTB_RB2_SIZE                                     0x1
#define _PORTB_RB2_LENGTH                                   0x1
#define _PORTB_RB2_MASK                                     0x4
#define _PORTB_RB3_POSN                                     0x3
#define _PORTB_RB3_POSITION                                 0x3
#define _PORTB_RB3_SIZE                                     0x1
#define _PORTB_RB3_LENGTH                                   0x1
#define _PORTB_RB3_MASK                                     0x8
#define _PORTB_RB4_POSN                                     0x4
#define _PORTB_RB4_POSITION                                 0x4
#define _PORTB_RB4_SIZE                                     0x1
#define _PORTB_RB4_LENGTH                                   0x1
#define _PORTB_RB4_MASK                                     0x10
#define _PORTB_RB5_POSN                                     0x5
#define _PORTB_RB5_POSITION                                 0x5
#define _PORTB_RB5_SIZE                                     0x1
#define _PORTB_RB5_LENGTH                                   0x1
#define _PORTB_RB5_MASK                                     0x20
#define _PORTB_RB6_POSN                                     0x6
#define _PORTB_RB6_POSITION                                 0x6
#define _PORTB_RB6_SIZE                                     0x1
#define _PORTB_RB6_LENGTH                                   0x1
#define _PORTB_RB6_MASK                                     0x40
#define _PORTB_RB7_POSN                                     0x7
#define _PORTB_RB7_POSITION                                 0x7
#define _PORTB_RB7_SIZE                                     0x1
#define _PORTB_RB7_LENGTH                                   0x1
#define _PORTB_RB7_MASK                                     0x80
#define _PORTB_AN4_POSN                                     0x0
#define _PORTB_AN4_POSITION                                 0x0
#define _PORTB_AN4_SIZE                                     0x1
#define _PORTB_AN4_LENGTH                                   0x1
#define _PORTB_AN4_MASK                                     0x1
#define _PORTB_AN5_POSN                                     0x1
#define _PORTB_AN5_POSITION                                 0x1
#define _PORTB_AN5_SIZE                                     0x1
#define _PORTB_AN5_LENGTH                                   0x1
#define _PORTB_AN5_MASK                                     0x2
#define _PORTB_CCP1_POSN                                    0x3
#define _PORTB_CCP1_POSITION                                0x3
#define _PORTB_CCP1_SIZE                                    0x1
#define _PORTB_CCP1_LENGTH                                  0x1
#define _PORTB_CCP1_MASK                                    0x8
#define _PORTB_AN6_POSN                                     0x4
#define _PORTB_AN6_POSITION                                 0x4
#define _PORTB_AN6_SIZE                                     0x1
#define _PORTB_AN6_LENGTH                                   0x1
#define _PORTB_AN6_MASK                                     0x10
#define _PORTB_PGM_POSN                                     0x5
#define _PORTB_PGM_POSITION                                 0x5
#define _PORTB_PGM_SIZE                                     0x1
#define _PORTB_PGM_LENGTH                                   0x1
#define _PORTB_PGM_MASK                                     0x20
#define _PORTB_PGC_POSN                                     0x6
#define _PORTB_PGC_POSITION                                 0x6
#define _PORTB_PGC_SIZE                                     0x1
#define _PORTB_PGC_LENGTH                                   0x1
#define _PORTB_PGC_MASK                                     0x40
#define _PORTB_PGD_POSN                                     0x7
#define _PORTB_PGD_POSITION                                 0x7
#define _PORTB_PGD_SIZE                                     0x1
#define _PORTB_PGD_LENGTH                                   0x1
#define _PORTB_PGD_MASK                                     0x80
#define _PORTB_INT0_POSN                                    0x0
#define _PORTB_INT0_POSITION                                0x0
#define _PORTB_INT0_SIZE                                    0x1
#define _PORTB_INT0_LENGTH                                  0x1
#define _PORTB_INT0_MASK                                    0x1
#define _PORTB_INT1_POSN                                    0x1
#define _PORTB_INT1_POSITION                                0x1
#define _PORTB_INT1_SIZE                                    0x1
#define _PORTB_INT1_LENGTH                                  0x1
#define _PORTB_INT1_MASK                                    0x2
#define _PORTB_INT2_POSN                                    0x2
#define _PORTB_INT2_POSITION                                0x2
#define _PORTB_INT2_SIZE                                    0x1
#define _PORTB_INT2_LENGTH                                  0x1
#define _PORTB_INT2_MASK                                    0x4
#define _PORTB_KBI0_POSN                                    0x4
#define _PORTB_KBI0_POSITION                                0x4
#define _PORTB_KBI0_SIZE                                    0x1
#define _PORTB_KBI0_LENGTH                                  0x1
#define _PORTB_KBI0_MASK                                    0x10
#define _PORTB_KBI1_POSN                                    0x5
#define _PORTB_KBI1_POSITION                                0x5
#define _PORTB_KBI1_SIZE                                    0x1
#define _PORTB_KBI1_LENGTH                                  0x1
#define _PORTB_KBI1_MASK                                    0x20
#define _PORTB_KBI2_POSN                                    0x6
#define _PORTB_KBI2_POSITION                                0x6
#define _PORTB_KBI2_SIZE                                    0x1
#define _PORTB_KBI2_LENGTH                                  0x1
#define _PORTB_KBI2_MASK                                    0x40
#define _PORTB_KBI3_POSN                                    0x7
#define _PORTB_KBI3_POSITION                                0x7
#define _PORTB_KBI3_SIZE                                    0x1
#define _PORTB_KBI3_LENGTH                                  0x1
#define _PORTB_KBI3_MASK                                    0x80
#define _PORTB_CK_POSN                                      0x1
#define _PORTB_CK_POSITION                                  0x1
#define _PORTB_CK_SIZE                                      0x1
#define _PORTB_CK_LENGTH                                    0x1
#define _PORTB_CK_MASK                                      0x2
#define _PORTB_P1B_POSN                                     0x2
#define _PORTB_P1B_POSITION                                 0x2
#define _PORTB_P1B_SIZE                                     0x1
#define _PORTB_P1B_LENGTH                                   0x1
#define _PORTB_P1B_MASK                                     0x4
#define _PORTB_P1A_POSN                                     0x3
#define _PORTB_P1A_POSITION                                 0x3
#define _PORTB_P1A_SIZE                                     0x1
#define _PORTB_P1A_LENGTH                                   0x1
#define _PORTB_P1A_MASK                                     0x8
#define _PORTB_DT_POSN                                      0x4
#define _PORTB_DT_POSITION                                  0x4
#define _PORTB_DT_SIZE                                      0x1
#define _PORTB_DT_LENGTH                                    0x1
#define _PORTB_DT_MASK                                      0x10
#define _PORTB_P1C_POSN                                     0x6
#define _PORTB_P1C_POSITION                                 0x6
#define _PORTB_P1C_SIZE                                     0x1
#define _PORTB_P1C_LENGTH                                   0x1
#define _PORTB_P1C_MASK                                     0x40
#define _PORTB_P1D_POSN                                     0x7
#define _PORTB_P1D_POSITION                                 0x7
#define _PORTB_P1D_SIZE                                     0x1
#define _PORTB_P1D_LENGTH                                   0x1
#define _PORTB_P1D_MASK                                     0x80
#define _PORTB_TX_POSN                                      0x1
#define _PORTB_TX_POSITION                                  0x1
#define _PORTB_TX_SIZE                                      0x1
#define _PORTB_TX_LENGTH                                    0x1
#define _PORTB_TX_MASK                                      0x2
#define _PORTB_RX_POSN                                      0x4
#define _PORTB_RX_POSITION                                  0x4
#define _PORTB_RX_SIZE                                      0x1
#define _PORTB_RX_LENGTH                                    0x1
#define _PORTB_RX_MASK                                      0x10
#define _PORTB_T1OSO_POSN                                   0x6
#define _PORTB_T1OSO_POSITION                               0x6
#define _PORTB_T1OSO_SIZE                                   0x1
#define _PORTB_T1OSO_LENGTH                                 0x1
#define _PORTB_T1OSO_MASK                                   0x40
#define _PORTB_T1OSI_POSN                                   0x7
#define _PORTB_T1OSI_POSITION                               0x7
#define _PORTB_T1OSI_SIZE                                   0x1
#define _PORTB_T1OSI_LENGTH                                 0x1
#define _PORTB_T1OSI_MASK                                   0x80
#define _PORTB_T13CKI_POSN                                  0x6
#define _PORTB_T13CKI_POSITION                              0x6
#define _PORTB_T13CKI_SIZE                                  0x1
#define _PORTB_T13CKI_LENGTH                                0x1
#define _PORTB_T13CKI_MASK                                  0x40
#define _PORTB_T1CKI_POSN                                   0x6
#define _PORTB_T1CKI_POSITION                               0x6
#define _PORTB_T1CKI_SIZE                                   0x1
#define _PORTB_T1CKI_LENGTH                                 0x1
#define _PORTB_T1CKI_MASK                                   0x40
#define _PORTB_CCP2_PA2_POSN                                0x3
#define _PORTB_CCP2_PA2_POSITION                            0x3
#define _PORTB_CCP2_PA2_SIZE                                0x1
#define _PORTB_CCP2_PA2_LENGTH                              0x1
#define _PORTB_CCP2_PA2_MASK                                0x8

